Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz8110ca90144.h
#define PIN_PA16B_ADC_VINP18                       _UINT32_(16)
#define MUX_PA16B_ADC_VINP18                       _UINT32_(1) 
#define PINMUX_PA16B_ADC_VINP18                    ((PIN_PA16B_ADC_VINP18 << 16) | MUX_PA16B_ADC_VINP18)
#define PORT_PA16B_ADC_VINP18                      (_UINT32_(1) << 16)

#define PIN_PA15B_ADC_VINP19                       _UINT32_(15)
#define MUX_PA15B_ADC_VINP19                       _UINT32_(1) 
#define PINMUX_PA15B_ADC_VINP19                    ((PIN_PA15B_ADC_VINP19 << 16) | MUX_PA15B_ADC_VINP19)
#define PORT_PA15B_ADC_VINP19                      (_UINT32_(1) << 15)

#define PIN_PA29B_ADC_VINP20                       _UINT32_(29)
#define MUX_PA29B_ADC_VINP20                       _UINT32_(1) 
#define PINMUX_PA29B_ADC_VINP20                    ((PIN_PA29B_ADC_VINP20 << 16) | MUX_PA29B_ADC_VINP20)
#define PORT_PA29B_ADC_VINP20                      (_UINT32_(1) << 29)

#define PIN_PA28B_ADC_VINP21                       _UINT32_(28)
#define MUX_PA28B_ADC_VINP21                       _UINT32_(1) 
#define PINMUX_PA28B_ADC_VINP21                    ((PIN_PA28B_ADC_VINP21 << 16) | MUX_PA28B_ADC_VINP21)
#define PORT_PA28B_ADC_VINP21                      (_UINT32_(1) << 28)

#define PIN_PA14B_ADC_VINP24                       _UINT32_(14)
#define MUX_PA14B_ADC_VINP24                       _UINT32_(1) 
#define PINMUX_PA14B_ADC_VINP24                    ((PIN_PA14B_ADC_VINP24 << 16) | MUX_PA14B_ADC_VINP24)
#define PORT_PA14B_ADC_VINP24                      (_UINT32_(1) << 14)

#define PIN_PA13B_ADC_VINP25                       _UINT32_(13)
#define MUX_PA13B_ADC_VINP25                       _UINT32_(1) 
#define PINMUX_PA13B_ADC_VINP25                    ((PIN_PA13B_ADC_VINP25 << 16) | MUX_PA13B_ADC_VINP25)
#define PORT_PA13B_ADC_VINP25                      (_UINT32_(1) << 13)

#define PIN_PA12B_ADC_VINP26                       _UINT32_(12)
#define MUX_PA12B_ADC_VINP26                       _UINT32_(1) 
#define PINMUX_PA12B_ADC_VINP26                    ((PIN_PA12B_ADC_VINP26 << 16) | MUX_PA12B_ADC_VINP26)
#define PORT_PA12B_ADC_VINP26                      (_UINT32_(1) << 12)

#define PIN_PA11B_ADC_VINP27                       _UINT32_(11)
#define MUX_PA11B_ADC_VINP27                       _UINT32_(1) 
#define PINMUX_PA11B_ADC_VINP27                    ((PIN_PA11B_ADC_VINP27 << 16) | MUX_PA11B_ADC_VINP27)
#define PORT_PA11B_ADC_VINP27                      (_UINT32_(1) << 11)

#define PIN_PA27B_ADC_VINP28                       _UINT32_(27)
#define MUX_PA27B_ADC_VINP28                       _UINT32_(1) 
#define PINMUX_PA27B_ADC_VINP28                    ((PIN_PA27B_ADC_VINP28 << 16) | MUX_PA27B_ADC_VINP28)
#define PORT_PA27B_ADC_VINP28                      (_UINT32_(1) << 27)

#define PIN_PA26B_ADC_VINP29                       _UINT32_(26)
#define MUX_PA26B_ADC_VINP29                       _UINT32_(1) 
#define PINMUX_PA26B_ADC_VINP29                    ((PIN_PA26B_ADC_VINP29 << 16) | MUX_PA26B_ADC_VINP29)
#define PORT_PA26B_ADC_VINP29                      (_UINT32_(1) << 26)

#define PIN_PA10B_ADC_VINP32                       _UINT32_(10)
#define MUX_PA10B_ADC_VINP32                       _UINT32_(1) 
#define PINMUX_PA10B_ADC_VINP32                    ((PIN_PA10B_ADC_VINP32 << 16) | MUX_PA10B_ADC_VINP32)
#define PORT_PA10B_ADC_VINP32                      (_UINT32_(1) << 10)

#define PIN_PA09B_ADC_VINP33                       _UINT32_(9) 
#define MUX_PA09B_ADC_VINP33                       _UINT32_(1) 
#define PINMUX_PA09B_ADC_VINP33                    ((PIN_PA09B_ADC_VINP33 << 16) | MUX_PA09B_ADC_VINP33)
#define PORT_PA09B_ADC_VINP33                      (_UINT32_(1) << 9)

#define PIN_PA08B_ADC_VINP34                       _UINT32_(8) 
#define MUX_PA08B_ADC_VINP34                       _UINT32_(1) 
#define PINMUX_PA08B_ADC_VINP34                    ((PIN_PA08B_ADC_VINP34 << 16) | MUX_PA08B_ADC_VINP34)
#define PORT_PA08B_ADC_VINP34                      (_UINT32_(1) << 8)

#define PIN_PA07B_ADC_VINP35                       _UINT32_(7) 
#define MUX_PA07B_ADC_VINP35                       _UINT32_(1) 
#define PINMUX_PA07B_ADC_VINP35                    ((PIN_PA07B_ADC_VINP35 << 16) | MUX_PA07B_ADC_VINP35)
#define PORT_PA07B_ADC_VINP35                      (_UINT32_(1) << 7)

#define PIN_PA25B_ADC_VINP36                       _UINT32_(25)
#define MUX_PA25B_ADC_VINP36                       _UINT32_(1) 
#define PINMUX_PA25B_ADC_VINP36                    ((PIN_PA25B_ADC_VINP36 << 16) | MUX_PA25B_ADC_VINP36)
#define PORT_PA25B_ADC_VINP36                      (_UINT32_(1) << 25)

#define PIN_PA24B_ADC_VINP37                       _UINT32_(24)
#define MUX_PA24B_ADC_VINP37                       _UINT32_(1) 
#define PINMUX_PA24B_ADC_VINP37                    ((PIN_PA24B_ADC_VINP37 << 16) | MUX_PA24B_ADC_VINP37)
#define PORT_PA24B_ADC_VINP37                      (_UINT32_(1) << 24)

/* ========== PORT definition for BSDAP peripheral ========== */
#define PIN_PC20G_BSDAP_TCK_SWCLK                  _UINT32_(84)
#define MUX_PC20G_BSDAP_TCK_SWCLK                  _UINT32_(6) 
#define PINMUX_PC20G_BSDAP_TCK_SWCLK               ((PIN_PC20G_BSDAP_TCK_SWCLK << 16) | MUX_PC20G_BSDAP_TCK_SWCLK)
#define PORT_PC20G_BSDAP_TCK_SWCLK                 (_UINT32_(1) << 20)

#define PIN_PC17G_BSDAP_TDI                        _UINT32_(81)
#define MUX_PC17G_BSDAP_TDI                        _UINT32_(6) 
#define PINMUX_PC17G_BSDAP_TDI                     ((PIN_PC17G_BSDAP_TDI << 16) | MUX_PC17G_BSDAP_TDI)
#define PORT_PC17G_BSDAP_TDI                       (_UINT32_(1) << 17)

#define PIN_PC19G_BSDAP_TDO                        _UINT32_(83)
#define MUX_PC19G_BSDAP_TDO                        _UINT32_(6) 
#define PINMUX_PC19G_BSDAP_TDO                     ((PIN_PC19G_BSDAP_TDO << 16) | MUX_PC19G_BSDAP_TDO)
#define PORT_PC19G_BSDAP_TDO                       (_UINT32_(1) << 19)

#define PIN_PC18G_BSDAP_TMS_SWDIO                  _UINT32_(82)
#define MUX_PC18G_BSDAP_TMS_SWDIO                  _UINT32_(6) 
#define PINMUX_PC18G_BSDAP_TMS_SWDIO               ((PIN_PC18G_BSDAP_TMS_SWDIO << 16) | MUX_PC18G_BSDAP_TMS_SWDIO)
#define PORT_PC18G_BSDAP_TMS_SWDIO                 (_UINT32_(1) << 18)

/* ========== PORT definition for CAN0 peripheral ========== */
#define PIN_PC04H_CAN0_RX                          _UINT32_(68)
#define MUX_PC04H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PC04H_CAN0_RX                       ((PIN_PC04H_CAN0_RX << 16) | MUX_PC04H_CAN0_RX)
#define PORT_PC04H_CAN0_RX                         (_UINT32_(1) << 4)

#define PIN_PC19H_CAN0_RX                          _UINT32_(83)
#define MUX_PC19H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PC19H_CAN0_RX                       ((PIN_PC19H_CAN0_RX << 16) | MUX_PC19H_CAN0_RX)
#define PORT_PC19H_CAN0_RX                         (_UINT32_(1) << 19)

#define PIN_PC05H_CAN0_TX                          _UINT32_(69)
#define MUX_PC05H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC05H_CAN0_TX                       ((PIN_PC05H_CAN0_TX << 16) | MUX_PC05H_CAN0_TX)
#define PORT_PC05H_CAN0_TX                         (_UINT32_(1) << 5)

#define PIN_PC20H_CAN0_TX                          _UINT32_(84)
#define MUX_PC20H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC20H_CAN0_TX                       ((PIN_PC20H_CAN0_TX << 16) | MUX_PC20H_CAN0_TX)
#define PORT_PC20H_CAN0_TX                         (_UINT32_(1) << 20)

/* ========== PORT definition for CAN1 peripheral ========== */
#define PIN_PC06H_CAN1_RX                          _UINT32_(70)
#define MUX_PC06H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PC06H_CAN1_RX                       ((PIN_PC06H_CAN1_RX << 16) | MUX_PC06H_CAN1_RX)
#define PORT_PC06H_CAN1_RX                         (_UINT32_(1) << 6)

#define PIN_PD08H_CAN1_RX                          _UINT32_(104)
#define MUX_PD08H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PD08H_CAN1_RX                       ((PIN_PD08H_CAN1_RX << 16) | MUX_PD08H_CAN1_RX)
#define PORT_PD08H_CAN1_RX                         (_UINT32_(1) << 8)

#define PIN_PC07H_CAN1_TX                          _UINT32_(71)
#define MUX_PC07H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PC07H_CAN1_TX                       ((PIN_PC07H_CAN1_TX << 16) | MUX_PC07H_CAN1_TX)
#define PORT_PC07H_CAN1_TX                         (_UINT32_(1) << 7)

#define PIN_PD09H_CAN1_TX                          _UINT32_(105)
#define MUX_PD09H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PD09H_CAN1_TX                       ((PIN_PD09H_CAN1_TX << 16) | MUX_PD09H_CAN1_TX)
#define PORT_PD09H_CAN1_TX                         (_UINT32_(1) << 9)

/* ========== PORT definition for CAN2 peripheral ========== */
#define PIN_PC25H_CAN2_RX                          _UINT32_(89)
#define MUX_PC25H_CAN2_RX                          _UINT32_(7) 
#define PINMUX_PC25H_CAN2_RX                       ((PIN_PC25H_CAN2_RX << 16) | MUX_PC25H_CAN2_RX)
#define PORT_PC25H_CAN2_RX                         (_UINT32_(1) << 25)

#define PIN_PC26H_CAN2_TX                          _UINT32_(90)
#define MUX_PC26H_CAN2_TX                          _UINT32_(7) 
#define PINMUX_PC26H_CAN2_TX                       ((PIN_PC26H_CAN2_TX << 16) | MUX_PC26H_CAN2_TX)
#define PORT_PC26H_CAN2_TX                         (_UINT32_(1) << 26)

/* ========== PORT definition for CAN3 peripheral ========== */
#define PIN_PC29H_CAN3_RX                          _UINT32_(93)
#define MUX_PC29H_CAN3_RX                          _UINT32_(7) 
#define PINMUX_PC29H_CAN3_RX                       ((PIN_PC29H_CAN3_RX << 16) | MUX_PC29H_CAN3_RX)
#define PORT_PC29H_CAN3_RX                         (_UINT32_(1) << 29)

